In [1]:
# Import initial dependencies
import os
import pandas as pd
import numpy as np

In [2]:
# Read CSVs into dataframes
stops10 = pd.read_csv("stops_2010.csv", encoding="utf-8", low_memory=False)
stops11 = pd.read_csv("stops_2011.csv", encoding="utf-8", low_memory=False)
stops12 = pd.read_csv("stops_2012.csv", encoding="utf-8", low_memory=False)
stops13 = pd.read_csv("stops_2013.csv", encoding="utf-8", low_memory=False)
stops14 = pd.read_csv("stops_2014.csv", encoding="utf-8", low_memory=False)
stops15 = pd.read_csv("stops_2015.csv", encoding="utf-8", low_memory=False)

In [3]:
# Cut down to desired columns
stops10 = stops10[['stop_date', 'county_name', 'driver_gender',
        'driver_race', 'search_conducted', 
        'contraband_found', 'stop_outcome', 'officer_id']]
stops11 = stops11[['stop_date', 'county_name', 'driver_gender',
        'driver_race', 'search_conducted', 
        'contraband_found', 'stop_outcome', 'officer_id']] 
stops12 = stops12[['stop_date', 'county_name', 'driver_gender',
        'driver_race', 'search_conducted', 
        'contraband_found', 'stop_outcome', 'officer_id']] 
stops13 = stops13[['stop_date', 'county_name', 'driver_gender',
        'driver_race', 'search_conducted', 
        'contraband_found', 'stop_outcome', 'officer_id']] 
stops14 = stops14[['stop_date', 'county_name', 'driver_gender',
        'driver_race', 'search_conducted', 
        'contraband_found', 'stop_outcome', 'officer_id']] 
stops15 = stops15[['stop_date', 'county_name', 'driver_gender',
        'driver_race', 'search_conducted', 
        'contraband_found', 'stop_outcome', 'officer_id']]

In [4]:
# Clean column names
stops10.columns = ['date', 'county', 'gender', 'race',
       'searched', 'contraband', 'outcome', 'officer_id']
stops11.columns = ['date', 'county', 'gender', 'race',
       'searched', 'contraband', 'outcome', 'officer_id']
stops12.columns = ['date', 'county', 'gender', 'race',
       'searched', 'contraband', 'outcome', 'officer_id']
stops13.columns = ['date', 'county', 'gender', 'race',
       'searched', 'contraband', 'outcome', 'officer_id']
stops14.columns = ['date', 'county', 'gender', 'race',
       'searched', 'contraband', 'outcome', 'officer_id']
stops15.columns = ['date', 'county', 'gender', 'race',
       'searched', 'contraband', 'outcome', 'officer_id']

In [5]:
# Group by date for total stops per day of year
by_date10 = stops10.groupby("date").count()
by_date10 = by_date10[["county"]]
by_date10.columns = ["stops_2010"]

# Reset index and remove year to leave just month/day
by_date10.reset_index(inplace=True) 
by_date10["date"] = by_date10["date"].map(lambda x: str(x)[5:])

# Group other dfs by date and reset index so they can be joined
by_date11 = stops11.groupby("date").count()
by_date11.reset_index(inplace=True)
by_date11 = by_date11[["county"]]
by_date11.columns = ["stops_2011"]

by_date12 = stops12.groupby("date").count()
by_date12.reset_index(inplace=True)
by_date12 = by_date12[["county"]]
by_date12.columns = ["stops_2012"]

by_date13 = stops13.groupby("date").count()
by_date13.reset_index(inplace=True)
by_date13 = by_date13[["county"]]
by_date13.columns = ["stops_2013"]

by_date14 = stops14.groupby("date").count()
by_date14.reset_index(inplace=True)
by_date14 = by_date14[["county"]]
by_date14.columns = ["stops_2014"]

by_date15 = stops15.groupby("date").count()
by_date15.reset_index(inplace=True)
by_date15 = by_date15[["county"]]
by_date15.columns = ["stops_2015"]

In [6]:
# Add columns together for single dataframe
by_date10["stops_2011"] = by_date11["stops_2011"]
by_date10["stops_2012"] = by_date12["stops_2012"]
by_date10["stops_2013"] = by_date13["stops_2013"]
by_date10["stops_2014"] = by_date14["stops_2014"]
by_date10["stops_2015"] = by_date15["stops_2015"]

# Rename for clarity
total_stops_by_year = by_date10
total_stops_by_year.head()

,date,stops_2010,stops_2011,stops_2012,stops_2013,stops_2014,stops_2015
0,01-01,6869,7815,5768,4389,4713,1212
1,01-02,11000,11390,3350,2674,1956,857
2,01-03,9707,3336,3059,3378,2709,2694
3,01-04,2820,3157,3421,2905,3572,3265
4,01-05,3604,3884,3530,3985,2408,2909

In [7]:
# Same stuff with grouping by gender
by_gender = stops10.groupby("gender").count()
by_gender = by_gender[["outcome"]]
by_gender.columns = ["stops_2010"]

by_gender11 = stops11.groupby("gender").count()
by_gender11 = by_gender11[["outcome"]]
by_gender11.columns = ["stops_2011"]

by_gender12 = stops12.groupby("gender").count()
by_gender12 = by_gender12[["outcome"]]
by_gender12.columns = ["stops_2012"]

by_gender13 = stops13.groupby("gender").count()
by_gender13 = by_gender13[["outcome"]]
by_gender13.columns = ["stops_2013"]

by_gender14 = stops14.groupby("gender").count()
by_gender14 = by_gender14[["outcome"]]
by_gender14.columns = ["stops_2014"]

by_gender15 = stops15.groupby("gender").count()
by_gender15 = by_gender15[["outcome"]]
by_gender15.columns = ["stops_2015"]

In [8]:
# Joining dataframes together
by_gender["stops_2011"] = by_gender11["stops_2011"]
by_gender["stops_2012"] = by_gender12["stops_2012"]
by_gender["stops_2013"] = by_gender13["stops_2013"]
by_gender["stops_2014"] = by_gender14["stops_2014"]
by_gender["stops_2015"] = by_gender15["stops_2015"]

# Reset index and rename for clarity
by_gender.reset_index(inplace=True)
by_gender.head()

,gender,stops_2010,stops_2011,stops_2012,stops_2013,stops_2014,stops_2015
0,F,509012,516934,491313,437128,378355,358980
1,M,988067,984597,921544,815750,709916,661306

In [9]:
by_gender = by_gender.transpose()
by_gender.reset_index(inplace=True)
by_gender.columns = ["year", "male", "female"]
by_gender = by_gender.drop(by_gender.index[0])
by_gender["year"] = by_gender["year"].map(lambda x: str(x)[6:])
by_gender

   year    male  female
1  2010  509012  988067
2  2011  516934  984597
3  2012  491313  921544
4  2013  437128  815750
5  2014  378355  709916
6  2015  358980  661306

In [10]:
total_stops_by_gender = by_gender

In [15]:
# Same stuff with grouping by race
by_race = stops10.groupby("race").count()
by_race = by_race[["outcome"]]
by_race.columns = ["stops_2010"]

by_race11 = stops11.groupby("race").count()
by_race11 = by_race11[["outcome"]]
by_race11.columns = ["stops_2011"]

by_race12 = stops12.groupby("race").count()
by_race12 = by_race12[["outcome"]]
by_race12.columns = ["stops_2012"]

by_race13 = stops13.groupby("race").count()
by_race13 = by_race13[["outcome"]]
by_race13.columns = ["stops_2013"]

by_race14 = stops14.groupby("race").count()
by_race14 = by_race14[["outcome"]]
by_race14.columns = ["stops_2014"]

by_race15 = stops15.groupby("race").count()
by_race15 = by_race15[["outcome"]]
by_race15.columns = ["stops_2015"]

In [16]:
# Joining dataframes together
by_race["stops_2011"] = by_race11["stops_2011"]
by_race["stops_2012"] = by_race12["stops_2012"]
by_race["stops_2013"] = by_race13["stops_2013"]
by_race["stops_2014"] = by_race14["stops_2014"]
by_race["stops_2015"] = by_race15["stops_2015"]

# Reset index and rename for clarity
by_race.reset_index(inplace=True)
by_race.head()

,race,stops_2010,stops_2011,stops_2012,stops_2013,stops_2014,stops_2015
0,Asian,26292,29033,27646,24802,21308,20492
1,Black,139213,139834,131818,115261,100306,95064
2,Hispanic,400432,398764,364754,337820,329426,339409
3,Other,2815,2888,3356,3708,3344,5292
4,White,881498,883144,844325,735141,597789,521032

In [17]:
by_race = by_race.transpose()
by_race.reset_index(inplace=True)
by_race.columns = ["year", "asian", "black", "hispanic", "other", "white"]
by_race = by_race.drop(by_race.index[0])
by_race["year"] = by_race["year"].map(lambda x: str(x)[6:])
by_race

   year  asian   black hispanic other   white
1  2010  26292  139213   400432  2815  881498
2  2011  29033  139834   398764  2888  883144
3  2012  27646  131818   364754  3356  844325
4  2013  24802  115261   337820  3708  735141
5  2014  21308  100306   329426  3344  597789
6  2015  20492   95064   339409  5292  521032

In [18]:
total_stops_by_race = by_race

In [19]:
# Same stuff with grouping by county
by_county = stops10.groupby("county").count()
by_county = by_county[["outcome"]]
by_county.columns = ["stops_2010"]

by_county11 = stops11.groupby("county").count()
by_county11 = by_county11[["outcome"]]
by_county11.columns = ["stops_2011"]

by_county12 = stops12.groupby("county").count()
by_county12 = by_county12[["outcome"]]
by_county12.columns = ["stops_2012"]

by_county13 = stops13.groupby("county").count()
by_county13 = by_county13[["outcome"]]
by_county13.columns = ["stops_2013"]

by_county14 = stops14.groupby("county").count()
by_county14 = by_county14[["outcome"]]
by_county14.columns = ["stops_2014"]

by_county15 = stops15.groupby("county").count()
by_county15 = by_county15[["outcome"]]
by_county15.columns = ["stops_2015"]

In [20]:
# Joining dataframes together
by_county["stops_2011"] = by_county11["stops_2011"]
by_county["stops_2012"] = by_county12["stops_2012"]
by_county["stops_2013"] = by_county13["stops_2013"]
by_county["stops_2014"] = by_county14["stops_2014"]
by_county["stops_2015"] = by_county15["stops_2015"]

# Reset index and rename for clarity
by_county.reset_index(inplace=True)
by_county.head()

,county,stops_2010,stops_2011,stops_2012,stops_2013,stops_2014,stops_2015
0,Anderson County,7049,10922,9404,8731,7250,5513
1,Andrews County,1899,2305,3309,1424,812,1219
2,Angelina County,9923,8291,9571,7502,6890,8208
3,Aransas County,1677,1626,2042,2881,2220,1645
4,Archer County,5041,5578,4874,4222,2432,2961

In [21]:
total_stops_by_county = by_county

In [22]:
# Import SQLAlchemy dependencies
import sqlalchemy
from sqlalchemy import create_engine, MetaData, inspect
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Numeric, Text, Float, ForeignKey
from sqlalchemy.orm import sessionmaker, relationship

In [23]:
engine = create_engine("sqlite:///speeding.sqlite")

In [24]:
Base = declarative_base()

In [25]:
class Date_stops(Base):
    
    __tablename__ = 'date_stops'
    
    id = Column(Integer, primary_key=True, autoincrement=True)
    date = Column(Text)
    stops_2010 = Column(Integer)
    stops_2011 = Column(Integer)
    stops_2012 = Column(Integer)
    stops_2013 = Column(Integer)
    stops_2014 = Column(Integer)
    stops_2015 = Column(Integer)
    
    def __repr__(self):
        return f"{self.date}: 2010 - {self.stops_2010}"
    
class Gender_stops(Base):
    
    __tablename__ = 'gender_stops'
    
    id = Column(Integer, primary_key=True, autoincrement=True)
    year = Column(Text)
    male = Column(Integer)
    female = Column(Integer)
    
    def __repr__(self):
        return f"{self.gender}: 2010 - {self.stops_2010}"

class Race_stops(Base):
    
    __tablename__ = 'race_stops'
    
    id = Column(Integer, primary_key=True, autoincrement=True)
    year = Column(Text)
    asian = Column(Integer)
    black = Column(Integer)
    hispanic = Column(Integer)
    other = Column(Integer)
    white = Column(Integer)
    
    def __repr__(self):
        return f"{self.race}: 2010 - {self.stops_2010}"

class County_stops(Base):
    
    __tablename__ = 'county_stops'
    
    id = Column(Integer, primary_key=True, autoincrement=True)
    county = Column(Text)
    stops_2010 = Column(Integer)
    stops_2011 = Column(Integer)
    stops_2012 = Column(Integer)
    stops_2013 = Column(Integer)
    stops_2014 = Column(Integer)
    stops_2015 = Column(Integer)
    
    def __repr__(self):
        return f"{self.county}: 2010 - {self.stops_2010}"

In [26]:
Base.metadata.create_all(engine)

In [27]:
engine.table_names()

['county_stops',
 'crashes',
 'date_stops',
 'demographics',
 'gender_stops',
 'race_stops']

In [28]:
inspector = inspect(engine)
inspector.get_columns('race_stops')

[{'autoincrement': 'auto',
  'default': None,
  'name': 'id',
  'nullable': False,
  'primary_key': 1,
  'type': INTEGER()},
 {'autoincrement': 'auto',
  'default': None,
  'name': 'year',
  'nullable': True,
  'primary_key': 0,
  'type': TEXT()},
 {'autoincrement': 'auto',
  'default': None,
  'name': 'asian',
  'nullable': True,
  'primary_key': 0,
  'type': INTEGER()},
 {'autoincrement': 'auto',
  'default': None,
  'name': 'black',
  'nullable': True,
  'primary_key': 0,
  'type': INTEGER()},
 {'autoincrement': 'auto',
  'default': None,
  'name': 'hispanic',
  'nullable': True,
  'primary_key': 0,
  'type': INTEGER()},
 {'autoincrement': 'auto',
  'default': None,
  'name': 'other',
  'nullable': True,
  'primary_key': 0,
  'type': INTEGER()},
 {'autoincrement': 'auto',
  'default': None,
  'name': 'white',
  'nullable': True,
  'primary_key': 0,
  'type': INTEGER()}]

In [29]:
# connect to the database
conn = engine.connect()

# Orient='records' creates a list of data to write
date_data = total_stops_by_year.to_dict(orient='records')
gender_data = total_stops_by_gender.to_dict(orient='records')
race_data = total_stops_by_race.to_dict(orient='records')
county_data = total_stops_by_county.to_dict(orient='records')

# Insert the dataframe into the database in one bulk insert
#conn.execute(Date_stops.__table__.delete())
conn.execute(Date_stops.__table__.insert(), date_data)
#conn.execute(Gender_stops.__table__.delete())
conn.execute(Gender_stops.__table__.insert(), gender_data)
#conn.execute(Race_stops.__table__.delete())
conn.execute(Race_stops.__table__.insert(), race_data)
#conn.execute(County_stops.__table__.delete())
conn.execute(County_stops.__table__.insert(), county_data)

conn.close()

In [30]:
engine.execute("SELECT * FROM date_stops LIMIT 5").fetchall()

[(1, '01-01', 6869, 7815, 5768, 4389, 4713, 1212),
 (2, '01-02', 11000, 11390, 3350, 2674, 1956, 857),
 (3, '01-03', 9707, 3336, 3059, 3378, 2709, 2694),
 (4, '01-04', 2820, 3157, 3421, 2905, 3572, 3265),
 (5, '01-05', 3604, 3884, 3530, 3985, 2408, 2909)]

In [31]:
engine.execute("SELECT * FROM gender_stops LIMIT 5").fetchall()

[(1, '2010', 509012, 988067),
 (2, '2011', 516934, 984597),
 (3, '2012', 491313, 921544),
 (4, '2013', 437128, 815750),
 (5, '2014', 378355, 709916)]

In [32]:
engine.execute("SELECT * FROM race_stops LIMIT 5").fetchall()

[(1, '2010', 26292, 139213, 400432, 2815, 881498),
 (2, '2011', 29033, 139834, 398764, 2888, 883144),
 (3, '2012', 27646, 131818, 364754, 3356, 844325),
 (4, '2013', 24802, 115261, 337820, 3708, 735141),
 (5, '2014', 21308, 100306, 329426, 3344, 597789)]

In [33]:
engine.execute("SELECT * FROM county_stops LIMIT 5").fetchall()

[(1, 'Anderson County', 7049, 10922, 9404, 8731, 7250, 5513),
 (2, 'Andrews County', 1899, 2305, 3309, 1424, 812, 1219),
 (3, 'Angelina County', 9923, 8291, 9571, 7502, 6890, 8208),
 (4, 'Aransas County', 1677, 1626, 2042, 2881, 2220, 1645),
 (5, 'Archer County', 5041, 5578, 4874, 4222, 2432, 2961)]